Repository: chrislongros/freebsd-doc-translate
Catalog: documentation/content/*/books/fdp-primer/po-translations/_index.po
Languages: pt_br

source: How to work with PO translation in the FreeBSD Documentation Project
pt_br: Como trabalhar com tradução de arquivos PO no Projeto de Documentação do FreeBSD

source: Chapter 9. PO Translations
pt_br: Capítulo 9. Traduções PO

source: PO Translations
pt_br: Traduções PO

source: Introduction
pt_br: Introdução

source: The http://www.gnu.org/software/gettext/[GNU gettext] system offers translators an easy way to create and maintain translations of documents. Translatable strings are extracted from the original document into a PO (Portable Object) file. Translated versions of the strings are entered with a separate editor. The strings can be used directly or built into a complete translated version of the original document.
pt_br: O http://www.gnu.org/software/gettext/[GNU gettext] oferece aos tradutores uma maneira fácil de criar e manter traduções de documentos. Sequências traduzíveis são extraídas do documento original em um arquivo PO (Portable Object). Versões traduzidas das strings são inseridas com um editor separado. As strings podem ser usadas diretamente ou incorporadas em uma versão traduzida completa do documento original.

source: Quick Start
pt_br: Introdução

source: The procedure shown in crossref:overview[overview-quick-start,Quick Start] is assumed to have already been performed. The `TRANSLATOR` option is required and already enabled by default in the package:textproc/docproj[] port.
pt_br: Supõe-se que o procedimento mostrado no crossref:overview[overview-quick-start,Quick Start] já tenha sido executado. A opção `TRANSLATOR` é necessária e já está ativada por padrão no port package:textproc/docproj[].

source: This example shows the creation of a Spanish translation of the short link:{leap-seconds}[Leap Seconds] article.
pt_br: Este exemplo mostra a criação de uma tradução em Espanhol do pequeno artigo link:{leap-seconds}[Leap Seconds].

source: Procedure: Install a PO Editor
pt_br: Procedimento. Instale um Editor PO

source: A PO editor is needed to edit translation files. This example uses package:editors/poedit[].
pt_br: É necessário um editor PO para editar os arquivos de tradução. Este exemplo utiliza o package:editors/poedit[].

source: Procedure: Initial Setup
pt_br: Procedimento. Configuração Inicial

source: When a new translation is first created, the directory structure must be created or copied from the English original:
pt_br: Quando uma nova tradução é criada pela primeira vez, a estrutura do diretório e o Makefile devem ser criados ou copiados do original em Inglês:

source: Create a directory for the new translation. The English article source is in [.filename]#~/doc/documentation/content/en/articles/leap-seconds/#. The Spanish translation will go in [.filename]#~/doc/documentation/content/es/articles/leap-seconds/#. The path is the same except for the name of the language directory. The English article source is in [.filename]#~/doc/en/articles/leap-seconds/#. The Spanish translation will go in [.filename]#~/doc/es/articles/leap-seconds/#. The path is the same except for the name of the language directory.
pt_br: Crie um diretório para a nova tradução. O código fonte do artigo em Inglês está em [.filename]#~/doc/documentation/content/en/articles/leap-seconds/#. A tradução em Espanhol estará em [.filename]#~/doc/documentation/content/es/articles/leap-seconds/#. O caminho é o mesmo, exceto pelo nome do diretório de idiomas.

source: Copy the [.filename]#_index.adoc# from the original document into the translation directory:
pt_br: Copie o [.filename]#_index.adoc# do documento original para o diretório de tradução:

source: Procedure: Translation
pt_br: Procedimento. Tradução

source: Translating a document consists of two steps: extracting translatable strings from the original document, and entering translations for those strings. These steps are repeated until the translator feels that enough of the document has been translated to produce a usable translated document.
pt_br: A tradução de um documento consiste em duas etapas: extrair strings traduzíveis do documento original e inserir as traduções dessas strings. Essas etapas são repetidas até que o tradutor sinta que o documento foi traduzido o suficiente para produzir um documento traduzido que seja utilizável.

source: Extract the translatable strings from the original English version into a PO file:
pt_br: Extraia as strings traduzíveis da versão original em Inglês para um arquivo PO:

source: Use a PO editor to enter translations in the PO file. There are several different editors available. [.filename]#poedit# from package:editors/poedit[] is shown here.
pt_br: Use um editor PO para inserir as traduções no arquivo PO. Existem vários editores diferentes disponíveis. O [.filename]#poedit# do package:editors/poedit[] é mostrado aqui.

source: Procedure: Generating a Translated Document
pt_br: Procedimento. Gerando um Documento Traduzido

source: Generate the translated document:
pt_br: Gere o documento traduzido:

source: The name of the generated document matches the name of the English original, usually [.filename]#_index.adoc#.
pt_br: O nome do documento gerado corresponde ao nome do original em Inglês, geralmente [.filename]#_index.adoc#.

source: Check the generated file by rendering it to HTML and viewing it with a web browser:
pt_br: Verifique o arquivo gerado renderizando-o para HTML e exibindo-o com um navegador web:

source: Creating New Translations
pt_br: Criando Novas Traduções

source: The first step to creating a new translated document is locating or creating a directory to hold it. FreeBSD puts translated documents in a subdirectory named for their language and region in the format [.filename]#lang#. _lang_ is a two-character lowercase code.
pt_br: O primeiro passo para criar um novo documento traduzido é localizar ou criar um diretório para mantê-lo. O FreeBSD coloca documentos traduzidos em um subdiretório nomeado para seu idioma e região no formato [.filename]#lang# . _lang_ é um código minúsculo de dois caracteres.

source: Language Names
pt_br: Nomes de Idioma

source: The translations are in subdirectories of the main documentation directory, here assumed to be [.filename]#~/doc/documentation/# as shown in <<overview-quick-start>>. For example, German translations are located in [.filename]#~/doc/documentation/content/de/#, and French translations are in [.filename]#~/doc/documentation/content/fr/#.
pt_br: As traduções estão em subdiretórios do diretório principal da documentação, aqui assumido como [.filename]#~/doc/documentation/# como apresentado no <<overview-quick-start>>. Por exemplo, as traduções em Alemão estão localizadas em [.filename]#~/doc/documentation/content/de/# e as traduções em Francês estão em [.filename]#~/doc/documentation/content/fr/#.

source: Each language directory contains separate subdirectories named for the type of documents, usually [.filename]#articles/# and [.filename]#books/#.
pt_br: Cada diretório de idiomas contém subdiretórios separados para os tipos de documentos, geralmente [.filename]#articles/# e [.filename]#books/#.

source: Combining these directory names gives the complete path to an article or book. For example, the French translation of the NanoBSD article is in [.filename]#~/doc/documentation/content/fr/articles/nanobsd/#, and the Mongolian translation of the Handbook is in [.filename]#~/doc/documentation/content/mn/books/handbook/#.
pt_br: A combinação desses nomes de diretórios fornece o caminho completo para um artigo ou livro. Por exemplo, a tradução Francesa do artigo NanoBSD está em [.filename]#~/doc/documentation/content/fr/articles/nanobsd/#, e a tradução em Mongol do manual está em [.filename]#~/doc/documentation/content/mn/books/handbook/#.

source: A new language directory must be created when translating a document to a new language. If the language directory already exists, only a subdirectory in the [.filename]#articles/# or [.filename]#books/# directory is needed.
pt_br: Um novo diretório de idioma deve ser criado ao traduzir um documento para um novo idioma. Se o diretório de idiomas já existir, somente um subdiretório no diretório [.filename]#articles/# ou [.filename]#books/# será necessário.

source: Creating a Spanish Translation of the Porter's Handbook
pt_br: Criando uma Tradução em Espanhol do Porter's Handbook

source: Create a new Spanish translation of the link:{porters-handbook}[Porter's Handbook]. The original is a book in [.filename]#~/doc/documentation/content/en/books/porters-handbook/#.
pt_br: Crie uma nova tradução em Espanhol do link:{porters-handbook}[Porter's Handbook]. O original é um livro em [.filename]#~/doc/documentation/content/en/books/porters-handbook/#.

source: The Spanish language books directory [.filename]#~/doc/documentation/content/es/books/# already exists, so only a new subdirectory for the Porter's Handbook is needed:
pt_br: O diretório de livros em Espanhol [.filename]#~/doc/documentation/content/es/books/# já existe, portanto, apenas um novo subdiretório para o Porter's Handbook é necessário:

source: Copy the content from the original book:
pt_br: Copie o conteúdo do livro original:

source: Now the document structure is ready for the translator to begin translating with `po4a` command.
pt_br: Agora a estrutura do documento está pronta para o tradutor começar a tradução com o `poedit`.

source: Translating
pt_br: Traduzindo

source: The gettext system greatly reduces the number of things that must be tracked by a translator. Strings to be translated are extracted from the original document into a PO file. Then a PO editor is used to enter the translated versions of each string.
pt_br: O sistema gettext reduz bastante o número de itens que devem ser rastreados por um tradutor. As strings a serem traduzidas são extraídas do documento original em um arquivo PO. Em seguida, um editor PO é usado para inserir as traduções de cada string.

source: The FreeBSD PO translation system does not overwrite PO files, so the extraction step can be run at any time to update the PO file.
pt_br: O sistema de tradução PO do FreeBSD não sobrescreve os arquivos PO, portanto a etapa de extração pode ser executada a qualquer momento para atualizar o arquivo PO.

source: A PO editor is used to edit the file. package:editors/poedit[] is shown in these examples because it is simple and has minimal requirements. Other PO editors offer features to make the job of translating easier. The Ports Collection offers several of these editors, including package:devel/gtranslator[].
pt_br: Um editor PO é usado para editar o arquivo. package:editors/poedit[] é usado nestes exemplos porque é simples e tem requisitos mínimos. Outros editores PO oferecem recursos para facilitar o trabalho de tradução. A Coleção de Ports oferece vários desses editores, incluindo o package:devel/gtranslator[].

source: It is important to preserve the PO file. It contains all of the work that translators have done.
pt_br: É importante preservar o arquivo PO. Ele contém todo o trabalho que os tradutores fizeram.

source: Translating the Porter's Handbook to Spanish
pt_br: Traduzindo o Porter's Handbook para o Espanhol

source: Change to the base directory and update all PO files.
pt_br: Mude para o diretório base e atualize todos os arquivos PO.

source: Enter translations using a PO editor:
pt_br: Realize as traduções usando um editor de PO:

source: These steps are necessary for all `.adoc` files, excluding `chapters-order.adoc` and `toc-*.adoc`.
pt_br: Essas etapas são necessárias para todos os arquivos `.adoc`, exceto `chapters-order.adoc` e `toc-*.adoc`.

source: Tips for Translators
pt_br: Dicas para Tradutores

source: Preserving AsciiDoc macros
pt_br: Preservando macros AsciiDoc

source: Preserve AsciiDoc macros that are shown in the English original.
pt_br: Preserve as macros AsciiDoc que são mostradas no original em Inglês.

source: English original:
pt_br: Inglês original:

source: Spanish translation:
pt_br: Tradução para o Espanhol:

source: Preserving Spaces
pt_br: Preservando Espaços

source: Preserve existing spaces at the beginning and end of strings to be translated. The translated version must have these spaces also.
pt_br: Preserve os espaços existentes no início e no final das strings a serem traduzidas. A versão traduzida também deve ter esses espaços.

source: Verbatim Tags
pt_br: Tags

source: The contents of some tags should be copied verbatim, not translated:
pt_br: O conteúdo de algumas tags devem ser copiadas igualmente, sem realizar tradução:

source: Building a Translated Document
pt_br: Compilando um Documento Traduzido

source: A translated version of the original document can be created at any time. Any untranslated portions of the original will be included in English in the resulting document. Most PO editors have an indicator that shows how much of the translation has been completed. This makes it easy for the translator to see when enough strings have been translated to make building the final document worthwhile.
pt_br: Uma versão traduzida do documento original pode ser criada a qualquer momento. Quaisquer porções não traduzidas do original serão incluídas em Inglês no documento resultante. A maioria dos editores PO tem um indicador que mostra quanto da tradução foi realizada. Isso torna mais fácil para o tradutor ver quantas strings foram traduzidas para tornar a compilação do documento final utilizável.

source: Submitting the New Translation
pt_br: Submetendo a Nova Tradução

source: Prepare the new translation files for submission. This includes adding the files to the version control system, setting additional properties on them, then creating a diff for submission.
pt_br: Prepare os novos arquivos de tradução para envio. Isso inclui adicionar os arquivos ao sistema de controle de versão, definir propriedades adicionais e criar um diff para a submissão.

source: The diff files created by these examples can be attached to a https://bugs.freebsd.org/bugzilla/enter_bug.cgi?product=Documentation[documentation bug report] or https://reviews.freebsd.org/[code review].
pt_br: Os arquivos diff criados por esses exemplos podem ser anexados a um https://bugs.freebsd.org/bugzilla/enter_bug.cgi?product=Documentation[relatório de bug de documentação] ou https://reviews.freebsd.org/[revisão de código].

source: Spanish Translation of the NanoBSD Article
pt_br: Tradução Espanhola do Artigo NanoBSD

source: Create a diff of the new files from the [.filename]#~/doc/# base directory so the full path is shown with the filenames. This helps committers identify the target language directory.
pt_br: Crie um diff dos novos arquivos a partir do diretório base [.filename]#~/doc/# para que o caminho completo seja mostrado com os nomes dos arquivos. Isso ajuda os committers a identificar o diretório do idioma de destino.
